Tekla Open API Reference for Tekla Structures 2025
Contour.ContourPoints Property
 The contour points belonging to the contour.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ArrayList ContourPoints { get; set; }
Public Property ContourPoints As ArrayList
	Get
	Set
Property Value
Type: ArrayList
See Also
Reference
Contour Class
Tekla.Structures.Model Namespace